-------------------------------------------------
多态
多态是只，在继承时，函数申明为虚函数，运行时根据指针类型选择是调用父类函数还是子类函数。
-------------------------------------------------
重载
重载函数，重载操作符，函数名相同，参数不同
-------------------------------------------------
time_wait状态
tcp主动发起断开连接的一端会维持time_wait状态，因为被动方发送fin信号后，需要等待主动方回复的ack，否则会重复发送fin信号。
-------------------------------------------------
可变参数
-------------------------------------------------
友元
友元函数   普通函数作为一个类的友元函数
友元类   一个类作为另一个的友元类
友元成员函数 一个类的成员函数作为另一个类的友元函数
-------------------------------------------------
